import regex as re


HknjaNum_LIST = [
    r'143024',
    r'283077',
    r'01340017',
    r'01420017',
    r'01260017',
    r'01420017',
    r'06132559',
    r'06270375',
    r'06270771',
    r'06272272',
    r'33280017',
    r'48280861',
    r'48284087',
    r'81280026',
    r'81280042',
    r'81280075',
    r'81280117',
    r'81280240',
    r'81280869',
    r'81284036',
    r'81284028',
    r'81284036',
    r'81284077',
    r'81284085',
    r'81284093',
    r'81284101',
    r'81284051',
]




HknjaNum_no_1_LIST = [
    r'12345678',
]



# ( 氏名 , 氏名([\D]+) )
HonKKEY = [
    re.compile(r'氏名'),
    re.compile(r'世帯'),
    re.compile(r'帯生名'),
    re.compile(r'帯生'),
    ]
HonKKEY_FINDER = [
    re.compile(r'氏名([\D]+)'),
    re.compile(r'世帯([\D]+)'),
    re.compile(r'帯生名([\D]+)'),
    re.compile(r'帯生([\D]+)'),
    ]

